---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeVertex
source: html/8c022b91-723f-045d-3024-8cb037a41acc.htm
---
# Autodesk.Revit.DB.SlabShapeVertex

Represents a vertex of a slab shape edited element.

## Syntax (C#)
```csharp
public class SlabShapeVertex : IDisposable
```